Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: To declare a type variable property, mark the declaration with the static declaration modifier.
ja: 型変数プロパティを宣言するために、宣言にstatic宣言修飾子で印をつけてください。

source: To declare convenience initializers for a class, mark the initializer declaration with the convenience declaration modifier.
ja: あるクラスの便宜イニシャライザを宣言するために、そのイニシャライザ宣言をconvenience宣言修飾子を使って印してください。

source: To define a property wrapper, you make a structure, enumeration, or class that defines a wrappedValue property.
ja: プロパティラッパーを定義するには、あなたはあるwrappedValueプロパティを定義する構造体、列挙、またはクラスを作ります。

source: To define these requirements, the Container protocol needs a way to refer to the type of the elements that a container will hold, without knowing what that type is for a specific container.
ja: これらの要件を定義するために、Containerプロトコルは、あるコンテナが保持することになる要素の型を参照する方法を必要とします、その型がどんなコンテナのためのものか知ることなしにです。

source: To determine the answer for a % b, the % operator calculates the following equation and returns remainder as its output:
ja: a % bに対する答えを決定するために、%演算子は以下の等式を計算します、そしてその出力として余りを返します：

source: To discover the specific type of a constant or variable that is known only to be of type Any or AnyObject, you can use an is or as pattern in a switch statement’s cases.
ja: 型AnyまたはAnyObjectのものであることだけが知られている定数や変数の具体的な型を見つけるために、あなたはisまたはasパターンをswitch文のケース節の中で使うことができます。

source: To distinguish between methods or initializers whose names differ only by the names of their arguments, include the argument names in parentheses, with each argument name followed by a colon (:).
ja: 名前がそれらの引数の名前でだけ異なるものであるメソッド間またはイニシャライザ間で識別を行うために、丸括弧の中に引数名を、各引数名にコロン（:）を続けることで含めて下さい。

source: To distinguish between overloaded methods, use a type annotation.
ja: オーバーロードされたメソッド間で識別を行うには、型注釈を使ってください。

source: To do that, you need to create an instance of the structure or class.
ja: それをするために、あなたは構造体またはクラスのインスタンスをつくる必要があります。

source: To do this, it needs to access each item as a true Movie or Song, and not just as a MediaItem.
ja: これをするために、それは、ただMediaItemとしてではなく、本当のMovieまたはSongとして各項目にアクセスする必要があります。

source: To do this, you make parts of your code conditional.
ja: これをするために、あなたは、あなたのコードの一部を条件つきにします。

source: To enable indirection for a particular enumeration case, mark it with the indirect declaration modifier.
ja: ある特定の列挙ケース節に対して間接参照を可能にするには、それをindirect宣言修飾子で印してください。

source: To enable indirection for all the cases of an enumeration that have an associated value, mark the entire enumeration with the indirect modifier—this is convenient when the enumeration contains many cases that would each need to be marked with the indirect modifier.
ja: ある列挙の中のすべてのケース節、それらは関連値を持っている、に対して間接参照を可能にするには、その列挙全体をindirect修飾子で印してください—これはその列挙がそのそれぞれがindirect修飾子で印される必要がある多くのケース節を含んでいる時に適します。

source: To enable it in Xcode, set the “Build Libraries for Distribution” build setting (BUILD_LIBRARY_FOR_DISTRIBUTION) to Yes, as described in Xcode Help [https://help.apple.com/xcode/mac/current/#/dev04b3a04ba].
ja: それをXcodeで可能にするには、“Build Libraries for Distribution” ビルド設定（BUILD_LIBRARY_FOR_DISTRIBUTION）を Yes に設定してください、Xcode Help [https://help.apple.com/xcode/mac/current/#/dev04b3a04ba]で記述されるとおりに。

source: To enable library evolution mode on the command line, pass the -enable-library-evolution option to the Swift compiler.
ja: ライブラリ進化モードをコマンドライン上で可能にするには、-enable-library-evolutionオプションをスウィフトコンパイラに渡してください。

source: To enable this, Swift provides two identity operators:
ja: これを可能にするために、スウィフトは２つの同一性演算子を提供します：

source: To ensure conversion between numeric types maintains the value exactly, use the init(exactly:) initializer.
ja: 数値型の間の変換がその値を正確に維持するのを保証するために、init(exactly:)イニシャライザを使ってください。

source: To ensure that an error is handled, use a catch clause with a pattern that matches all errors, such as a wildcard pattern (_).
ja: エラーが処理されることが保証されるように、あるひとつのcatch節をどんなエラーにもマッチするパターンとともに使ってください、例えばワイルドカードパターン（_）など。

source: To evaluate the value of a subscript expression, the subscript getter for the expression’s type is called with the index expressions passed as the subscript parameters.
ja: 添え字式の値を評価するために、この式のもつ型のための添え字ゲッターが、添え字パラメータとして渡されるインデックス式を使って呼び出されます。

source: To explicitly fall through at the end of a particular switch case, use the fallthrough keyword, as described in Fallthrough.
ja: ある特定のswitchケース節の終わりで明示的に抜け落ちるには、フォールスルーで記述されるように、fallthroughキーワードを使用してください。

source: To express this fact, you write a type constraint of Equatable as part of the type parameter’s definition when you define the function:
ja: この事実を表すために、あなたはEquatableの型制約を型パラメータの定義の一部として、あなたが関数を定義する時に書きます：

source: To find out the number of items in a set, check its read-only count property:
ja: 集合の中の項目数を知るために、それの読み出し専用のcountプロパティを調べてください：

source: To find out the number of items in an array, check its read-only count property:
ja: ある配列の中の項目の数を知るために、その読み出し専用のcountプロパティを調べてください：

source: To handle an empty array safely, write the minMax(array:) function with an optional tuple return type and return a value of nil when the array is empty:
ja: 空の配列を安全に取り扱うために、minMax(array:)関数をオプショナルタプルの戻り型を使って書いて、配列が空の時にnilの値を返してください：

source: To help manage the currentLevel property, LevelTracker defines an instance method called advance(to:).
ja: currentLevelプロパティを管理するのを手伝うために、LevelTrackerはadvance(to:)と呼ばれるインスタンスメソッドを定義します。

source: To identify these places in your code, write the try keyword—or the try? or try! variation—before a piece of code that calls a function, method, or initializer that can throw an error.
ja: これらの場所をあなたのコードの中で識別するには、tryキーワードを ― またはその変種try?またはtry!を ― エラーをスローできる関数、メソッド、またはイニシャライザを呼び出すコードの前の場所に書いてください。

source: To illustrate this behavior, the following example defines two protocols and a generic type that conditionally conforms to both protocols.
ja: この挙動を図解するために、以下の例は２つのプロトコルおよび両方のプロトコルに条件付きで準拠する１つの総称体型を定義します。

source: To implement the +++ operator, you add a type method called +++ to Vector2D as follows:
ja: +++演算子を実装するには、あなたは+++と呼ばれる型メソッドを次のようにVector2Dに加えます：

source: To include the text """ in a multiline string, escape at least one of the quotation marks.
ja: テキスト"""を複数行文字列の中に含めるには、少なくとも１つの引用符記号の１つをエスケープしてください。

source: To indicate that a function, method, or initializer can throw an error, you write the throws keyword in the function’s declaration after its parameters.
ja: エラーをスローすることのできる関数、メソッド、またはイニシャライザを指し示すために、あなたはthrowsキーワードを関数の定義においてそれのパラメータの後に書きます。

source: To indicate that a subclass has a superclass, write the subclass name before the superclass name, separated by a colon:
ja: あるサブクラスがあるスーパークラスを持つことを表わすには、サブクラスの名前をスーパークラスの名前の前に、コロンで区切って書きます：

source: To insert a single character into a string at a specified index, use the insert(_:at:) method, and to insert the contents of another string at a specified index, use the insert(contentsOf:at:) method.
ja: ある単一の文字をある文字列中へ特定のインデックスで差し込むには、insert(_:at:)メソッドを使ってください、そして別の文字列の内容を特定のインデックスで差し込むには、insert(contentsOf:at:)メソッドを使ってください。

source: To insert an item into the array at a specified index, call the array’s insert(_:at:) method:
ja: ある項目を配列の中へ指定されたインデックスで差し入れるために、配列のinsert(_:at:)メソッドを呼んでください：

source: To iterate over the keys or values of a dictionary in a specific order, use the sorted() method on its keys or values property.
ja: 辞書のキーまたは値に特定の順序で繰り返していくために、sorted()メソッドをkeysまたはvaluesプロパティ上で使ってください。

source: To iterate over the values of a set in a specific order, use the sorted() method, which returns the set’s elements as an array sorted using the < operator.
ja: 集合の中の値に特定の順番で繰り返すには、sorted()メソッドを使ってください、それは集合の要素を<演算子を使って格納される配列として返します。

source: To learn how functions can return other functions, see Function Types as Return Types.
ja: 関数が他の関数を返すことができる方法を学ぶために、戻り型としての関数型を見てください。

source: To learn how to define new, custom operators, see Custom Operators and Operator Declaration.
ja: 新しい、あつらえの演算子を定義する方法を学ぶために、あつらえの演算子と演算子宣言を見てください。

source: To learn how to overload existing operators, see Operator Methods.
ja: 既存の演算子にオーバーロードする方法を学ぶために、演算子メソッドを見てください。

source: To make a switch with a single case that matches both "a" and "A", combine the two values into a compound case, separating the values with commas.
ja: ただ１つだけのケース節を持つあるswitchが"a"と"A"の両方にマッチするようにするには、２つの値をひとつの複合ケース節へと、コンマで値を隔てて結合してください。

source: To make a multiline string literal that begins or ends with a line feed, write a blank line as its first or last line.
ja: ラインフィードで始まるまたは終わる複数行文字列リテラルを作るには、空の行をそれの最初または最後の行に書いてください。

source: To make a multiline string literal that begins or ends with a line feed, write a blank line as the first or last line.
ja: ラインフィードで始まるまたは終わる複数行文字列リテラルを作るには、空の行を最初または最後の行として記述します。

source: To make it more useful, you need to refine it to describe more specific kinds of vehicles.
ja: それをより役に立つようにするために、あなたはそれを改良してより具体的な乗物の種類を記述する必要があります。

source: To make sure that instances don’t disappear while they are still needed, ARC tracks how many properties, constants, and variables are currently referring to each class instance.
ja: それがまだ必要な間にインスタンスが消えないことを確実にするために、ARCは、どれくらいのプロパティ、定数、および変数が目下のところ各クラスインスタンスに言及しているかを追跡します。

source: To make the body of this function shorter, you can combine the message creation and the return statement into one line:
ja: この関数の本文をより短くするために、あなたはメッセージ作成と返しの文を１行に結合することができます：

source: To make this possible, whenever you assign a class instance to a property, constant, or variable, that property, constant, or variable makes a strong reference to the instance.
ja: これを可能にするために、あなたがクラスインスタンスをプロパティ、定数、または変数に代入するときはいつでも、そのプロパティ、定数、または変数はそのインスタンスへの強い参照を作ります。

source: To model this restriction, the failable initializer triggers an initialization failure if an empty string is found.
ja: この制約条件をモデル化するために、失敗できるイニシャライザは空の文字列が見つけられるならば初期化失敗を引き起こします。

source: To nest a type within another type, write its definition within the outer braces of the type it supports.
ja: ある型を別の型の内部で入れ子にするために、その定義をそれが支援する型の外側の波括弧の範囲内で書いてください。

source: To opt in to overflow behavior, use Swift’s second set of arithmetic operators that overflow by default, such as the overflow addition operator (&+).
ja: オーバフロー挙動を選ぶために、初期状態でオーバフローするスウィフトの算術演算子の第二集合を使ってください、例えばオーバフロー加算演算子（&+）など。

source: To override a characteristic that would otherwise be inherited, you prefix your overriding definition with the override keyword.
ja: そうしなければ継承される特徴をオーバーライドするために、あなたは、あなたのオーバーライド定義の前にoverrideキーワードを置きます。

source: To prevent strong reference cycles, delegates are declared as weak references.
ja: 強い参照循環を防ぐために、委任先は弱い参照として宣言されます。

source: To print a value without a line break after it, pass an empty string as the terminator—for example, print(someValue, terminator: "").
ja: ある値をそれの後に改行なしで出力するには、空の文字列を終端子（ターミネータ）として渡してください ― 例えば、print(someValue, terminator: "")。

source: To project a value from a property wrapper, define a projectedValue instance property on the wrapper type.
ja: ある値をプロパティラッパーから見積もるには、projectedValueインスタンスプロパティをそのラッパー型上で定義してください。

source: To put it another way:
ja: 言い換えれば：

source: To receive a synthesized implementation of ==, declare Equatable conformance in the file that contains the original declaration, without implementing an == operator yourself.
ja: ==の合成された実装を受け取るには、Equatable準拠の宣言を元の宣言を含むファイルにおいて行ってください、==演算子をあなた自身で実装することなしに。

source: To reference the case of an enumeration type, use dot (.) syntax, as in EnumerationType.enumerationCase.
ja: 列挙型のケース節に言及するために、EnumerationType.enumerationCaseのように、ドット（.）構文を使ってください。

source: To reflect the fact that optional chaining can be called on a nil value, the result of an optional chaining call is always an optional value, even if the property, method, or subscript you are querying returns a non-optional value.
ja: オプショナル連鎖はnil値上で呼ばれることができるという事実を反映するために、オプショナル連鎖呼び出しの結果は、たとえあなたが問い合わせているプロパティ、メソッド、または添え字が非オプショナルの値を返すとしても、常にオプショナルの値です。

source: To remove a single character from a string at a specified index, use the remove(at:) method, and to remove a substring at a specified range, use the removeSubrange(_:) method:
ja: ある単一の文字をある文字列から特定のインデックスで削除するには、remove(at:)メソッドを使ってください、そして部分文字列を特定の範囲で削除するには、removeSubrange(_:)メソッドを使ってください。

source: To represent this fact, ShoppingListItem introduces a Boolean property called purchased, with a default value of false.
ja: この事実を表すために、ShoppingListItemは、falseの省略時の値で、purchasedと呼ばれるブールのプロパティを導入します。

source: To represent this game board, the Chessboard structure has a single property called boardColors, which is an array of 64 Bool values.
ja: このゲーム板を表すために、Chessboard構造体はboardColorsと呼ばれる１つのプロパティだけを持ちます、それは64個のBool値の配列です。

source: To represent this, board[03] is equal to +08, which is equivalent to an integer value of 8 (the difference between 3 and 11).
ja: これを表すために、board[03]は+08と等しいです、そしてそれは、整数値の８（3と11の差）に等しいです。

source: To represent this, the Customer class has an optional card property, but the CreditCard class has an unowned (and non-optional) customer property.
ja: これを表すために、Customerクラスはオプショナルのcardプロパティを持ちます、しかし、CreditCardクラスは非所有（そして非オプショナル）のcustomerプロパティを持ちます。

source: To represent this, the Country class has a capitalCity property, and the City class has a country property:
ja: これを表すために、CountryクラスはcapitalCityプロパティを持ちます、そして、Cityクラスはcountryプロパティを持ちます：

source: To require that subclasses implement a superclass’s initializer, mark the superclass’s initializer with the required declaration modifier.
ja: あるスーパークラスの持つイニシャライザをそのサブクラスたちが実装することを要求するために、そのスーパークラスのイニシャライザをrequired宣言修飾子で印してください。

source: To restrict the adoption of a protocol to class types only, include the AnyObject protocol in the inherited protocols list after the colon.
ja: あるプロトコルの採用をクラス型のみに制約するには、AnyObjectプロトコルを継承されたプロトコルのリストの中にコロンの後で加えてください。

source: To retrieve a count of the Character values in a string, use the count property of the string:
ja: ある文字列の中のCharacter値の総数を取り出すために、その文字列のcountプロパティを使ってください：

source: To see an example of how to create and implement a new operator, see Custom Operators.
ja: 新しい演算子の作成と実装の方法の例を見るには、あつらえの演算子を参照してください。

source: To see an example of how to use a do statement with several catch clauses, see Handling Errors.
ja: do文を複数のcatch節とともに使う方法の例を見るために、エラーを処理するを見てください。

source: To see examples of initializers in various type declarations, see Initialization.
ja: いろいろな型宣言におけるイニシャライザの例を見るために、初期化を見てください。

source: To set its value, the subscript setter is called in the same way.
ja: その値を設定するために、添え字セッターが同様に呼ばれます。

source: To set up the interdependency between the two classes, the initializer for City takes a Country instance, and stores this instance in its country property.
ja: ２つのクラスの間で相互依存を設定するために、Cityのためのイニシャライザは、Countryインスタンスをとって、このインスタンスをそれのcountryプロパティに保管します。

source: To simplify the relationships between designated and convenience initializers, Swift applies the following three rules for delegation calls between initializers:
ja: 指定と便宜イニシャライザの間の関係を単純化するために、スウィフトは以下の３つの規則をイニシャライザ間の委任呼び出しに対して適用します：

source: To specify an in-out parameter, prefix the parameter type with the inout keyword.
ja: in-outパラメータを指定するために、inoutキーワードをそのパラメータ型の前に置いてください。

source: To specify that the push(_:) method has a single parameter called item, which must be of type Element
ja: push(_:)メソッドが１つのパラメータ、itemと呼ばれるものを持つことを指定する所で、それは、型Elementでなければなりません

source: To specify that the value returned by the pop() method will be a value of type Element
ja: pop()メソッドによって返される値が型Elementの値であることを示す所で

source: To support recursion, the compiler must insert a layer of indirection.
ja: 再帰をサポートするために、コンパイラは間接参照の階層を差し入れる必要があります。

source: To support setting an initial value or other customization, the property wrapper needs to add an initializer.
ja: 初期値の設定または他のカスタマイゼーションをサポートするには、プロパティラッパーはイニシャライザの追加を必要とします。

source: To use a function, you “call” that function with its name and pass it input values (known as arguments) that match the types of the function’s parameters.
ja: ある関数を使うためには、あなたはその関数をそれの名前を使って「呼び出し」、それにその関数のパラメータの型に適合する入力値（引数として知られます）を渡します。

source: To use a nested type outside of its definition context, prefix its name with the name of the type it is nested within:
ja: 入れ子にされた型をその定義の文脈外で使うために、その名前にそれが入れ子にされている型の名前で接頭辞を付けてください：

source: To use a reserved word as an identifier, put a backtick (`) before and after it.
ja: 識別子として予約語を使用するために、それの前後にバッククォート（`）を置いてください。

source: To use it in the ternary conditional (? :) operator, it must have whitespace around both sides.
ja: それを三項条件（? :）において使うためには、それは両側に空白を持ってはなりません。

source: To use optional chaining, use a question mark in place of the exclamation point:
ja: オプショナル連鎖を使用するために、感嘆符の代わりに疑問符を使ってください：

source: To use string interpolation inside a string that uses extended delimiters, match the number of number signs after the backslash to the number of number signs at the beginning and end of the string.
ja: 文字列補間を拡張区切り記号を使う文字列内部で使うには、バックスラッシュの後のシャープ記号の数をその文字列の始まりと終わりでのシャープ記号の数と合わせてください。

source: To use the ? as the optional-chaining operator, it must not have whitespace on the left.
ja: ?をオプショナル連鎖演算子として使うには、それは左側に空白を持ってはなりません。

source: To win, you must land exactly on square 25.
ja: 勝つために、あなたはぴったり正方形25に到着しなければなりません。

source: To work out the exact evaluation order to use, you also need to consider their associativity.
ja: 使用する的確な評価順序を解き明かすには、あなたはまたそれらの結合性を考慮する必要があります。

source: Top-Level Code
ja: トップレベル・コード

source: Tradition suggests that the first program in a new language should print the words “Hello, world!” on the screen.
ja: 伝統は、新しい言語において最初のプログラムが画面上に語句「Hello, world!」を出力しなければならないことを示唆します。

source: Trailing Closures
ja: 後付クロージャ

source: Trailing closure syntax
ja: 後付クロージャ構文

source: Trailing closures are most useful when the closure is sufficiently long that it is not possible to write it inline on a single line.
ja: クロージャがそれをただ１つの行の行内に書くことが可能でないほど長いとき、後付クロージャは最も役に立ちます。

source: Try Operator
ja: try演算子

source: Try removing the conversion to String from the last line.
ja: 最後の行からStringへの転換を取り除いてみてください。

source: Try removing the default case.
ja: 何れにも当てはまらない場合の部分（default: の部分）を取り除いてみてください。

source: Trying to change the value of a function parameter from within the body of that function results in a compile-time error.
ja: その関数の本文内部から関数パラメータの値を変えようとすることは、コンパイル時エラーに終わります。

source: Trying to set an Int16 constant or variable to a number outside of this range causes an error:
ja: Int16定数または変数をこの範囲の外側の数に設定する試みは、エラーを引き起こします：

source: Trying to store 24 actually stores a value of 12 instead, because 24 is too large for the property setter’s rule.
ja: 24を格納する試みは、実際には12の値を代わりに格納します、なぜなら24はプロパティのセッターのもつ規則には大きすぎるからです。

source: Trying to use ! to access a nonexistent optional value triggers a runtime error.
ja: 存在しないオプショナルの値にアクセスするために!を使うことを試みることは、実行時エラーの引き金となります。

source: Tuple Expression
ja: タプル式

source: Tuple Pattern
ja: タプルパターン

source: Tuple Type
ja: タプル型

source: Tuple Types
ja: タプル型

source: Tuple patterns match values of corresponding tuple types.
ja: タプルパターンは、対応するタプル型の値にマッチします。

source: Tuple types don’t have a standalone definition in the way that classes, structures, enumerations, and functions do.
ja: タプル型には、クラス、構造体、列挙、そして関数が行う方法での、独立した定義がありません。

source: Tuples
ja: タプル

source: Tuples are compared from left to right, one value at a time, until the comparison finds two values that aren’t equal.
ja: タプルは、左から右へと、一度に１つの値を、比較が等しくない２つの値を見つけるまで、比較されます。

source: Tuples are particularly useful as the return values of functions.
ja: タプルは、特に関数の戻り値として便利です。

source: Tuples are useful for simple groups of related values.
ja: タプルは、関連した値の単純なグループに対して便利です。

source: Tuples can also be used as parameter types and return types.
ja: タプルもまた、パラメータ型および戻り型として使われることができます。

source: Tuples can be compared with a given operator only if the operator can be applied to each value in the respective tuples.
ja: タプルは、与えられた演算子で比較されることが、その演算子がそれぞれのタプルの中の値それぞれに適用可能である場合にのみ可能です。

source: Tuples enable you to create and pass around groupings of values.
ja: タプルは、あなたに値のグループをつくってあちこち渡すことを可能にします。

source: Two String values (or two Character values) are considered equal if their extended grapheme clusters are canonically equivalent.
ja: ２つのString値（または２つのCharacter）は、それらの拡張書記素クラスタたちが正準等価ならば、等しいとみなされます。

source: Two extension declarations attempt to add conditional conformance to the Serializable protocol, one for for arrays with Int elements, and one for arrays with String elements.
ja: ２つの拡張宣言は、Serializableプロトコルへの条件準拠を加えることを試みます、Int要素を持つ配列のために１つ、そしてString要素を持つ配列のために１つ。

source: Two flipped shapes returned by this function might have completely different types.
ja: この関数によって返される２つの裏返された形状が、完全に異なる型を持つかもしれません。

source: Two-Phase Initialization
ja: ２段階初期化

source: Two-phase initialization prevents property values from being accessed before they are initialized, and prevents property values from being set to a different value by another initializer unexpectedly.
ja: ２段階初期化は、プロパティ値が初期化される前にアクセスされるのを妨げます、それによってプロパティ値が思いもよらず別のイニシャライザによって異なる値に設定されるのを防ぎます。

source: Type
ja: 型

source: Type Alias Declaration
ja: 型エイリアス宣言

source: Type Aliases
ja: 型エイリアス

source: Type Annotation
ja: 型注釈

source: Type Annotations
ja: さまざまな型注釈

source: Type Attributes
ja: 型属性

source: Type Casting
ja: 型キャスト

source: Type Casting for Any and AnyObject
ja: AnyおよびAnyObjectに対する型キャスト

source: Type Constraint Syntax
ja: 型制約構文

source: Type Constraints
ja: 型制約

source: Type Constraints in Action
ja: 型制約の動作

source: Type Identifier
ja: 型識別子

source: Type Inference
ja: 型推論

source: Type Inheritance Clause
ja: 型継承節

source: Type Methods
ja: 型メソッド

source: Type Parameters
ja: 型パラメータ

source: Type Properties
ja: 型プロパティ

source: Type Property Syntax
ja: 型プロパティ構文

source: Type Safety and Type Inference
ja: 型安全と型推論

source: Type Subscript Declarations
ja: 型添え字宣言

source: Type Subscripts
ja: 型添え字

source: Type Variable Properties
ja: 型変数プロパティ

source: Type alias declarations are declared using the typealias keyword and have the following form:
ja: 型エイリアス宣言は、キーワードtypealiasを使って宣言されます、そして以下の形式を持ちます：

source: Type aliases are useful when you want to refer to an existing type by a name that is contextually more appropriate, such as when working with data of a specific size from an external source:
ja: 型エイリアスは、あなたがより文脈上適切な名前で既存の型に言及したいとき役に立ちます、たとえば外部ソースからの特定の大きさのデータを扱う時など：

source: Type aliases do not create new types; they simply allow a name to refer to an existing type.
ja: 型エイリアスは、新しい型を作成しません；それらは、単にある名前が既存の型に言及できるようにします。

source: Type annotations begin with a colon (:) and end with a type, as the following examples show:
ja: 型注釈は、以下の例が示すように、コロン（:）で始まりひとつの型で終わります：

source: Type annotations can contain an optional list of type attributes before the type.
ja: 型注釈は、型の前に任意の型属性のリストを含むことができます。

source: Type casting enables you to check and interpret the type of a class instance at runtime.
ja: 型キャストは、あなたにクラスインスタンスの型を実行時に調べて解釈することを可能にします。

source: Type casting in Swift is implemented with the is and as operators.
ja: スウィフトでの型キャストは、isとas演算子を使って実行されます。

source: Type casts that can fail at runtime now use the as? or as! operator, and type casts that are guaranteed not to fail use the as operator.
ja: 実行時に失敗できる型キャストは、今ではas?またはas!演算子を使います、そして失敗しないことを保証される型キャストはas演算子を使います。

source: Type constraints specify that a type parameter must inherit from a specific class, or conform to a particular protocol or protocol composition.
ja: 型制約は、型パラメータが特定のクラスから継承しなければならない、もしくはある特定のプロトコルまたはプロトコル合成に準拠しなければならないことを指定します。

source: Type constraints, as described in Type Constraints, enable you to define requirements on the type parameters associated with a generic function, subscript, or type.
ja: 型制約は、「型制約」で記述されるように、総称体の関数、添え字、または型と関連した型パラメータに要件を定義することをあなたに可能にします。

source: Type inference enables a compiler to deduce the type of a particular expression automatically when it compiles your code, simply by examining the values you provide.
ja: 型推論は、コンパイラに自動的に特定の式の型を演繹することを、それがあなたのコードをコンパイルする時に、単純にあなたが提供する値を調べることによって、可能にします。

source: Type inference helps make Swift code more concise and readable when it initializes constants or variables with other values whose type is already known.
ja: 型推論は、スウィフトのコードを、それが定数または変数を型がすでに知られている他の値で初期化するとき、より簡潔で読みやすくするのを助けます。
